cfd/legendCoupeSpoiler_3_4/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

upperBody
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (COUPE_UPPER_BODY);
    rho             rhoInf;                 // Indicates incompressible
    rhoInf          1;                      // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);                // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         17.5;
    lRef            1.854;                  // Wheelbase length
    Aref            0.645;                  // Estimated for Coupe
}

spoiler
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (COUPE_SPOILER);
    rho             rhoInf;                 // Indicates incompressible
    rhoInf          1;                      // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);                // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         17.5;
    lRef            1.854;                  // Wheelbase length
    Aref            0.645;                  // Estimated for Coupe
}

lowerBody
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (COUPE_LOWER_BODY);     
    rho             rhoInf;                 // Indicates incompressible
    rhoInf          1;                      // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);                // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         17.5;
    lRef            1.854;                  // Wheelbase length
    Aref            0.645;                  // Estimated for Coupe
}

frontTyre
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (COUPE_FRONT_WHEEL);     
    rho             rhoInf;                 // Indicates incompressible
    rhoInf          1;                      // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);                // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         17.5;
    lRef            1.854;                  // Wheelbase length
    Aref            0.645;                  // Estimated for Coupe
}

rearWheel
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (COUPE_REAR_WHEEL);     
    rho             rhoInf;                 // Indicates incompressible
    rhoInf          1;                      // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);                // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         17.5;
    lRef            1.854;                  // Wheelbase length
    Aref            0.645;                  // Estimated for Coupe
}

all_0
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (COUPE_SPOILER COUPE_UPPER_BODY COUPE_LOWER_BODY COUPE_FRONT_WHEEL COUPE_REAR_WHEEL);     
    rho             rhoInf;                 // Indicates incompressible
    rhoInf          1;                      // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);                // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         17.5;
    lRef            1.854;                  // Wheelbase length
    Aref            0.645;                  // Estimated for Coupe
}

all_dx
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (COUPE_SPOILER COUPE_UPPER_BODY COUPE_LOWER_BODY COUPE_FRONT_WHEEL COUPE_REAR_WHEEL);     
    rho             rhoInf;                 // Indicates incompressible
    rhoInf          1;                      // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (1 0 0);                // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         17.5;
    lRef            1.854;                  // Wheelbase length
    Aref            0.645;                  // Estimated for Coupe
}

all_dz
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (COUPE_SPOILER COUPE_UPPER_BODY COUPE_LOWER_BODY COUPE_FRONT_WHEEL COUPE_REAR_WHEEL);     
    rho             rhoInf;                 // Indicates incompressible
    rhoInf          1;                      // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 1);                // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         17.5;
    lRef            1.854;                  // Wheelbase length
    Aref            0.645;                  // Estimated for Coupe
}


// ************************************************************************* //
