cfd/legendCoupeSpoiler_3_4/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;  //true;
snap            true;  //true;
addLayers       true;  //true;


// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{
    spoiler_coupe.stl
    {
        type triSurfaceMesh;
        name COUPE_SPOILER;
    }
    
    upperBody_coupe.stl
    {
        type triSurfaceMesh;
        name COUPE_UPPER_BODY;
    }

    lowerBody_coupe.stl
    {
        type triSurfaceMesh;
        name COUPE_LOWER_BODY;
    }

    frontWheel_coupe.stl
    {
        type triSurfaceMesh;
        name COUPE_FRONT_WHEEL;
    }

    rearWheel_coupe.stl
    {
        type triSurfaceMesh;
        name COUPE_REAR_WHEEL;
    }

    vr1
    {
        type searchableBox;
        min ( -7.5 0.0 0.0 );
        max ( 25.0 2.8 4 );
    }

    vr2
    {
        type searchableBox;
        min ( -4.5 0.0 0.0 );
        max ( 13 2 3 );
        //min ( -2.0 0.0 0.0 );
        //max (  6.0 2.0 2.0 );
    }

    vr3
    {
        type searchableBox;
        min ( -2.5 0.0 0.0 );
        max ( 7 1.6 2.3 );
    }

    vr4
    {
        type searchableBox;
        min ( -1.8 0.0 0.0 );
        max ( 5 1.3 1.9 );
    }

     vr5
     {
         type searchableBox;
         min (-1.8 0.0 0.0);
         max ( 3 1.2 1.8 );
     }

    // vr6
    // {
    //     type searchableBox;    // front wheel
    //     min ( -1.5 0.35 0.0);
    //     max ( -0.5 0.8 0.6);
    // }
    
}


// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    // If local number of cells is >= maxLocalCells on any processor
    // switches from from refinement followed by balancing
    // (current method) to (weighted) balancing before refinement.
    maxLocalCells 1500000;

    // Overall cell limit (approximately). Refinement will stop immediately
    // upon reaching this number so a refinement level might not complete.
    // Note that this is the number of cells before removing the part which
    // is not 'visible' from the keepPoint. The final number of cells might
    // actually be a lot less.
    maxGlobalCells 10000000;

    // The surface refinement loop might spend lots of iterations refining just a
    // few cells. This setting will cause refinement to stop if <= minimumRefine
    // are selected for refinement. Note: it will at least do one iteration
    // (unless the number of cells to refine is 0)
    minRefinementCells 0;      // originally 10 -- eMecc 0

    // Allow a certain level of imbalance during refining
    // (since balancing is quite expensive)
    // Expressed as fraction of perfect balance (= overall number of cells /
    // nProcs). 0=balance always.
    maxLoadUnbalance 0.10;


    // Number of buffer layers between different levels.
    // 1 means normal 2:1 refinement restriction, larger means slower
    // refinement.
    nCellsBetweenLevels 5;  //3



    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by its edges.
    // This is a featureEdgeMesh, read from constant/triSurface for now.
    features
    (
        {
            file "spoiler_coupe.eMesh";
            level 1;       // 6;
        }

        {
            file "upperBody_coupe.eMesh";
            level 1;       // 6;
        }

        {
            file "lowerBody_coupe.eMesh";
            level 1;       // 6;
        }

        {
            file "frontWheel_coupe.eMesh";
            level 1;       // 6;
        }

        {
            file "rearWheel_coupe.eMesh";
            level 1;       // 6;
        }

    );



    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.

    refinementSurfaces
    {
        COUPE_SPOILER
        {
            // Surface-wise min and max refinement level
            level (5 5);       //(5 6);

            // Optional specification of patch type (default is wall). No
            // constraint types (cyclic, symmetry) etc. are allowed.
            patchInfo
            {
                type wall;
                inGroups (spoiler_coupe_group);
            }
        }
        
        COUPE_UPPER_BODY
        {
            // Surface-wise min and max refinement level
            level (5 5);       //(5 6);

            // Optional specification of patch type (default is wall). No
            // constraint types (cyclic, symmetry) etc. are allowed.
            patchInfo
            {
                type wall;
                inGroups (upperBody_coupe_group);
            }
        }

        COUPE_LOWER_BODY
        {
            // Surface-wise min and max refinement level
            level (5 5);       //(5 6);

            // Optional specification of patch type (default is wall). No
            // constraint types (cyclic, symmetry) etc. are allowed.
            patchInfo
            {
                type wall;
                inGroups (lowerBody_coupe_group);
            }
        }

        COUPE_FRONT_WHEEL
        {
            // Surface-wise min and max refinement level
            level (5 5);       //(5 6);

            // Optional specification of patch type (default is wall). No
            // constraint types (cyclic, symmetry) etc. are allowed.
            patchInfo
            {
                type wall;
                inGroups (frontWheel_coupe_group);
            }
        }
        
        COUPE_REAR_WHEEL
        {
            // Surface-wise min and max refinement level
            level (5 5);       //(5 6);

            // Optional specification of patch type (default is wall). No
            // constraint types (cyclic, symmetry) etc. are allowed.
            patchInfo
            {
                type wall;
                inGroups (rearWheel_coupe_group);
            }
        }

    }

    // Resolve sharp angles
    resolveFeatureAngle 20;  // 30;


    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    // Specifies refinement level for cells in relation to a surface. One of
    // three modes
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   descending order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.

    refinementRegions
    {
       vr1
        {
            mode inside;
            levels (( 1E5 1 ));
        }

        vr2
        {
            mode inside;	
            levels (( 1E5 2 ));
        }


        vr3
        {
            mode inside;
            levels (( 1E5 3 ));
        }

        vr4
        {
            mode inside;
            levels (( 1E5 4 ));
        }

        vr5
        {
            mode inside;
            levels (( 1E5 5 ));
        }

        // vr6
        // {
        //     mode inside;
        //     levels (( 1E5 5));
        // } 
    }


    // Mesh selection
    // ~~~~~~~~~~~~~~

    // After refinement patches get added for all refinementSurfaces and
    // all cells intersecting the surfaces get put into these patches. The
    // section reachable from the locationInMesh is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
    locationInMesh (10.0 1.0 1.0 );


    // Whether any faceZones (as specified in the refinementSurfaces)
    // are only on the boundary of corresponding cellZones or also allow
    // free-standing zone faces. Not used if there are no faceZones.
    allowFreeStandingZoneFaces true;
}



// Settings for the snapping.
snapControls
{
    //- Number of patch smoothing iterations before finding correspondence
    //  to surface
    nSmoothPatch 3;

    //- Relative distance for points to be attracted by surface feature point
    //  or edge. True distance is this factor times local
    //  maximum edge length.
    tolerance 2.0;

    //- Number of mesh displacement relaxation iterations.
    nSolveIter 10; //30;

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 5;

    // Feature snapping

        //- Number of feature edge snapping iterations.
        //  Leave out altogether to disable.
        nFeatureSnapIter 10;

        //- Detect (geometric only) features by sampling the surface
        //  (default=false).
        implicitFeatureSnap false;

        //- Use castellatedMeshControls::features (default = true)
        explicitFeatureSnap true;

        //- Detect points on multiple surfaces (only for explicitFeatureSnap)
        multiRegionFeatureSnap false;
}



// Settings for the layer addition.
addLayersControls
{
    // Are the thickness parameters below relative to the undistorted
    // size of the refined cell outside layer (true) or absolute sizes (false).
    relativeSizes true;

    // Per final patch (so not geometry!) the layer information
    layers
    {
        COUPE_LOWER_BODY
        {
            nSurfaceLayers 3;
            expansionRatio 1.4;
            firstLayerThickness 0.6;
            minThickness 0.01;
        }

        COUPE_UPPER_BODY
        {
            nSurfaceLayers 3;
            expansionRatio 1.4;
            firstLayerThickness 0.6;
            minThickness 0.01;
        }

        COUPE_SPOILER
        {
            nSurfaceLayers 3;
            expansionRatio 1.4;
            firstLayerThickness 0.6;
            minThickness 0.01;
        }

        COUPE_REAR_WHEEL
        {
            nSurfaceLayers 2;
            expansionRatio 1.4;
            firstLayerThickness 0.2;
            minThickness 0.01;
        }

        COUPE_FRONT_WHEEL
        {
            nSurfaceLayers 2;
            expansionRatio 1.2;
            firstLayerThickness 0.2;
            minThickness 0.01;
        }

        ground
        {
            nSurfaceLayers 5;
            expansionRatio 1.2;
            finalLayerThickness 0.3;
            minThickness 0.05;
        }
    }

    // Expansion factor for layer mesh
    expansionRatio 1.4;

    // Wanted thickness of final added cell layer. If multiple layers
    // is the thickness of the layer furthest away from the wall.
    // Relative to undistorted size of cell outside layer.
    // See relativeSizes parameter.
    finalLayerThickness 0.3;

    // Minimum thickness of cell layer. If for any reason layer
    // cannot be above minThickness do not add layer.
    // Relative to undistorted size of cell outside layer.
    minThickness 0.1;

    // If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
    // Note: changed(corrected) w.r.t 1.7.x! (didn't do anything in 1.7.x)
    nGrow 0;

    // Advanced settings

    // When not to extrude surface. 0 is flat surface, 90 is when two faces
    // are perpendicular
    featureAngle 180;

    // At non-patched sides allow mesh to slip if extrusion direction makes
    // angle larger than slipFeatureAngle.
    slipFeatureAngle 30;

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 5;

    // Number of smoothing iterations of surface normals
    nSmoothSurfaceNormals 1;

    // Number of smoothing iterations of interior mesh movement direction
    nSmoothNormals 3;

    // Smooth layer thickness over surface patches
    nSmoothThickness 10;

    // Stop layer growth on highly warped cells
    maxFaceThicknessRatio 0.5;

    // Reduce layer growth where ratio thickness to medial
    // distance is large
    maxThicknessToMedialRatio 0.3;

    // Angle used to pick up medial axis points
    // Note: changed(corrected) w.r.t 1.7.x! 90 degrees corresponds to 130
    // in 1.7.x.
    minMedialAxisAngle 90;


    // Create buffer region for new layer terminations
    nBufferCellsNoExtrude 0;


    // Overall max number of layer addition iterations. The mesher will exit
    // if it reaches this number of iterations; possibly with an illegal
    // mesh.
    nLayerIter 20;  //50
    
    // !!!!!!! Added from eMec
    //nRelaxedIter 10;
}



// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    #include "meshQualityDict"


    // Advanced

    //- Number of error distribution iterations
    nSmoothScale 4;
    //- Amount to scale back displacement at error points
    errorReduction 0.75;

}


// Advanced

// Write flags
writeFlags
(
    scalarLevels
    layerSets
    layerFields     // write volScalarField for layer coverage
);


// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;


// ************************************************************************* //
